### Import the necessary libraries

In [1]:
import pandas as pd
import sqlalchemy as alch
#your code here

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [2]:
#Your code here 
from getpass import getpass

In [5]:
password = getpass("Introduce tu contraseña del server mysql si es que la sabes ")

Introduce tu contraseña del server mysql si es que la sabes ········

### Establishes the connection to the database

In [7]:
db_name = 'publications'

conec = f"mysql+pymysql://root:{password}@localhost/{db_name}"

### Remember to create the engine

In [8]:
#Your code here
engine = alch.create_engine(conec)
#engine
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [14]:
query1 = pd.read_sql_query (
'''
SELECT au_lname, au_fname, authors.au_id , publishers.pub_name, titles.title
FROM authors
INNER JOIN titleauthor
ON authors.au_id = titleauthor.au_id
INNER JOIN titles
ON titleauthor.title_id = titles.title_id
INNER JOIN publishers
ON titles.pub_id = publishers.pub_id;

''', engine
)
query1.head()

,au_lname,au_fname,au_id,pub_name,title
0,Green,Marjorie,213-46-8915,Algodata Infosystems,The Busy Executive's Database Guide
1,Bennet,Abraham,409-56-7008,Algodata Infosystems,The Busy Executive's Database Guide
2,O'Leary,Michael,267-41-2394,Algodata Infosystems,Cooking with Computers: Surreptitious Balance ...
3,MacFeather,Stearns,724-80-9391,Algodata Infosystems,Cooking with Computers: Surreptitious Balance ...
4,Green,Marjorie,213-46-8915,New Moon Books,You Can Combat Computer Stress!

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [17]:
query2 = pd.read_sql_query (
'''
SELECT CONCAT(au_fname,' ', au_lname) as full_name,  authors.au_id, publishers.pub_name, COUNT(titles.title)
FROM authors
INNER JOIN titleauthor
ON authors.au_id = titleauthor.au_id
INNER JOIN titles
ON titleauthor.title_id = titles.title_id
INNER JOIN publishers
ON titles.pub_id = publishers.pub_id
GROUP BY authors.au_id;

''', engine
)
query2.head()

            full_name        au_id              pub_name  COUNT(titles.title)
0      Marjorie Green  213-46-8915  Algodata Infosystems                    2
1      Abraham Bennet  409-56-7008  Algodata Infosystems                    1
2     Michael O'Leary  267-41-2394  Algodata Infosystems                    2
3  Stearns MacFeather  724-80-9391  Algodata Infosystems                    2
4       Dean Straight  274-80-9391  Algodata Infosystems                    1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [26]:
query3 = pd.read_sql_query(
'''
SELECT CONCAT(au_fname,' ', au_lname) as full_name,  authors.au_id, SUM(sales.qty) as total
FROM authors
INNER JOIN titleauthor
ON authors.au_id = titleauthor.au_id
INNER JOIN titles
ON titleauthor.title_id = titles.title_id
INNER JOIN sales
ON titles.title_id = sales.title_id
GROUP BY  authors.au_id
ORDER BY total DESC
LIMIT 3;

''', engine
)
query3.head()

        full_name        au_id  total
0     Anne Ringer  899-46-2035  148.0
1   Albert Ringer  998-72-3567  133.0
2  Marjorie Green  213-46-8915   50.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [27]:
query4 = pd.read_sql_query(
'''
SELECT CONCAT(au_fname,' ', au_lname) as full_name,  authors.au_id, SUM(sales.qty) as total
FROM authors
LEFT JOIN titleauthor
ON authors.au_id = titleauthor.au_id
LEFT JOIN titles
ON titleauthor.title_id = titles.title_id
LEFT JOIN sales
ON titles.title_id = sales.title_id
GROUP BY  authors.au_id
ORDER BY total DESC


''', engine
)
query4

                  full_name        au_id  total
0               Anne Ringer  899-46-2035  148.0
1             Albert Ringer  998-72-3567  133.0
2            Marjorie Green  213-46-8915   50.0
3                  Ann Dull  427-17-2319   50.0
4             Sheryl Hunter  846-92-7186   50.0
5           Michael O'Leary  267-41-2394   45.0
6        Stearns MacFeather  724-80-9391   45.0
7           Michel DeFrance  722-51-5454   40.0
8           Sylvia Panteley  807-91-6654   40.0
9             Cheryl Carson  238-95-7766   30.0
10        Charlene Locksley  486-29-1786   25.0
11          Burt Gringlesby  472-27-2349   20.0
12  Reginald Blotchet-Halls  648-92-1872   20.0
13           Akiko Yokomoto  672-71-3249   20.0
14             Livia Karsen  756-30-7391   20.0
15            Johnson White  172-32-1176   15.0
16            Dean Straight  274-80-9391   15.0
17           Abraham Bennet  409-56-7008   15.0
18       Innes del Castillo  712-45-1867   10.0
19            Meander Smith  341-22-1782    NaN
20       Morningstar Greene  527-72-3246    NaN
21            Dirk Stringer  724-08-9931    NaN
22         Heather McBadden  893-72-1158    NaN

## Bonus Challenge - Most Profiting Authors

In [28]:
query5 = pd.read_sql_query (
'''
SELECT CONCAT(au_fname,' ', au_lname) as full_name,  authors.au_id,  COUNT(sales.qty) as total, SUM(titles.royalty + titles.advance) as profit
FROM authors
INNER JOIN titleauthor
ON authors.au_id = titleauthor.au_id
INNER JOIN titles
ON titleauthor.title_id = titles.title_id
INNER JOIN sales
ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY profit DESC;


''',engine
)
query5.head()

         full_name        au_id  total   profit
0      Anne Ringer  899-46-2035      6  39196.0
1  Michel DeFrance  722-51-5454      2  30048.0
2   Marjorie Green  213-46-8915      3  20169.0
3    Albert Ringer  998-72-3567      5  15158.0
4  Michael O'Leary  267-41-2394      2  13020.0

In [29]:
# se que habria que hacer muchas mas operaciones con las royalties pero me empece a liar y cada vez entendia menos :)